{
  "name": "pxlAPI",
  "version": "0.0.0",
  "description": "pxlAPI Image Processing API",
  "title": "pxlAPI documentation",
  "header": {
    "title": "Introduction",
    "content": "<h2>Introduction</h2>\n<p><strong>pxlAPI</strong> is an HTTP image processing/manipulation API that also provides other miscellaneous services (e.g. web\nscraping).</p>\n<h3>Sending requests</h3>\n<p>All requests to <strong>pxlAPI</strong> should go to the APIs base URL (<code>https://api.pxlapi.dev/</code>), followed by the path of the\naction you want to execute (for example <code>https://api.pxlapi.dev/emojimosaic</code>). All available actions are documented on\nthis page.</p>\n<p>Most requests require an application access token to be supplied. This can be done by setting the <code>Authentication</code> HTTP\nheader to a value of <code>Application &lt;token&gt;</code>. Your Applications access tokens are available via\nthe <a href=\"https://pxlapi.dev\">management panel</a>.</p>\n<p>All JSON requests should include a <code>Content-Type</code> header with a value of <code>application/json</code>. If this header is not\nsupplied, the API will interpret the input as a binary buffer. The <code>Content-Type</code> header can be omitted when\ndirectly <code>POST</code>ing image data to the API, image type auto-detection will be run here.</p>\n<p>Controller parameters can also be retrieved from the requests query parameters (<code>?parameter=value</code>). This is useful if\nyou want to directly <code>POST</code> an image to the API. The JSON request body, if supplied, will always take priority.</p>\n<h3>Credits</h3>\n<p>Users get 30,000 free credits per month. This is equivalent to 5 minutes of processing time, assuming no special\nfeatures (like face detection) are used. For users who require more credits, paid credit packages are available via the\nmanagement dashboard. When a user gets close to running out of credits, emails will be sent stating the estimated time\nremaining until credits run out. When no more credits are available, the API will respond with a <code>402 Payment Required</code>.</p>\n<p>Please note that GIF processing can yield a large amount of processing time (and calls to face detection), so you might\nwant to either limit the count of frames to process (via the <code>frameLimit</code> request parameter), or instead only process a\nsingle frame of the GIF (either by directly supplying a still image (JPEG or PNG), or by setting <code>frameLimit</code> to 1).</p>\n<h3>Quota</h3>\n<p>Quota limits the amount of credits users and applications can spend per day. There are no quota limit set by default,\nbut custom limits can be set either via the edit account tab or the applications settings in the management portal. This\ncan be useful if you don't want a single application to use up all your credits, or you want to limit how many credits\nyou want to spend per day. When an application exceeds the set quota limits, the API will respond with\na <code>429 Too Many Requests</code></p>\n<h3>Supported Media Types</h3>\n<p>Currently, the following media types are supported for decoding:</p>\n<ul>\n<li><code>PNG</code></li>\n<li><code>JPEG</code></li>\n<li><code>TIFF</code></li>\n<li><code>GIF</code></li>\n</ul>\n<h3>Special Cases in this Documentation</h3>\n<ul>\n<li>A field type being suffixed by a question mark (<code>?</code>) means that this field is optional. A default value, if\napplicable, will be shown in <code>Allowed Values</code>. If no default value is applicable, an explanation of the default value\nmay appear in the fields description.</li>\n<li>Numeric and string length ranges are defined via the use of <code>min..max</code> in <code>Allowed Values</code>. If no maximum value is\ngiven, it is assumed to be Infinity. If no minimum value is given, it is assumed to be negative Infinity (or 0 in the\ncase of string lengths).</li>\n</ul>\n"
  },
  "template": {
    "withCompare": false,
    "withGenerator": false
  },
  "useHostUrlAsSampleUrl": false,
  "sampleUrl": false,
  "defaultVersion": "0.0.0",
  "apidoc": "0.3.0",
  "generator": {
    "name": "apidoc",
    "time": "2021-04-08T22:15:38.380Z",
    "url": "https://apidocjs.com",
    "version": "0.25.0"
  }
}
